app/controllers/query_requests_controller.rb

  def index
    @query_requests = QueryRequest.all
---
SELECT "query_requests".* FROM "query_requests"

  def create
    @query_request = QueryRequest.new(query_request_params)

    respond_to do |format|
      if @query_request.save
---
INSERT INTO "query_requests" ("header_element", "query_request_req_header", "header_request_id", "header_timestamp", "header_source_system", "credentials_element", "credentials_user", "credentials_password", "attributes_list", "attribute_element", "attribute_name", "attribute_value", "body_element", "body_query_request_req_element", "body_query_request_input_message", "body_query_request_id", "od_header_element", "od_query_request_input_message", "od_query_request_request_id", "od_query_request_return_code", "od_query_request_return_message", "od_query_request_timestamp", "od_query_request_body_element", "od_query_request_output_message", "od_query_request_status", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21, $22, $23, $24, $25, $26, $27) RETURNING "id"

  def destroy
    @query_request.destroy
---
DELETE FROM "query_requests" WHERE "query_requests"."id" = $1  [["id", 980190962]]

    def set_query_request
      @query_request = QueryRequest.find(params[:id])
---
SELECT  "query_requests".* FROM "query_requests" WHERE "query_requests"."id" = $1 LIMIT $2  [["id", 980190962], ["LIMIT", 1]]