app/controllers/query_balances_controller.rb

SELECT "query_balances".* FROM "query_balances"
---
  def index
    @query_balances = QueryBalance.all

INSERT INTO "query_balances" ("header_element", "query_balance_req_header", "header_request_id", "header_timestamp", "header_source_system", "credentials_element", "credentials_user", "credentials_password", "attributes_list", "attribute_element", "attribute_name", "attribute_value", "body_element", "body_query_balance_req_element", "body_query_balance_input_message", "od_header_element", "od_query_balance_input_message", "od_query_balance_request_id", "od_query_balance_return_code", "od_query_balance_return_message", "od_query_balance_timestamp", "od_query_balance_body_element", "od_query_balance_resp", "od_query_balance_output_message", "od_query_balance_balance", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21, $22, $23, $24, $25, $26, $27) RETURNING "id"
---
  def create
    @query_balance = QueryBalance.new(query_balance_params)

    respond_to do |format|
      if @query_balance.save

DELETE FROM "query_balances" WHERE "query_balances"."id" = $1  [["id", 980190962]]
---
  def destroy
    @query_balance.destroy

SELECT  "query_balances".* FROM "query_balances" WHERE "query_balances"."id" = $1 LIMIT $2  [["id", 980190962], ["LIMIT", 1]]
---
    def set_query_balance
      @query_balance = QueryBalance.find(params[:id])