app/controllers/return_code_apis_controller.rb

SELECT "return_code_apis".* FROM "return_code_apis"
---
  def index
    @return_code_apis = ReturnCodeApi.all.order(partner_id: :asc, return_code: :asc)

    options = {page: params[:page] || 1, per_page: 10}
    @return_code_apis = @return_code_apis.paginate(options)

INSERT INTO "return_code_apis" ("return_code", "return_description", "error_description", "error_description_pt", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @return_code_api = ReturnCodeApi.new(return_code_api_params)

    respond_to do |format|
      if @return_code_api.save

DELETE FROM "return_code_apis" WHERE "return_code_apis"."id" = $1  [["id", 980190962]]
---
  def destroy
    @return_code_api.destroy

SELECT  "return_code_apis".* FROM "return_code_apis" WHERE "return_code_apis"."id" = $1 LIMIT $2  [["id", 980190962], ["LIMIT", 1]]
---
    def set_return_code_api
      @return_code_api = ReturnCodeApi.find(params[:id])