app/controllers/topup_recargas_controller.rb

  def index
    @topup_recargas = TopupRecarga.all
---
SELECT "topup_recargas".* FROM "topup_recargas"

  def create
    @topup_recarga = TopupRecarga.new(topup_recarga_params)

    respond_to do |format|
      if @topup_recarga.save
---
INSERT INTO "topup_recargas" ("validation_id", "header_element", "topup_req_header", "request_id", "header_timestamp", "header_source_system", "credentials_element", "credentials_user", "credentials_password", "attributes_list", "attribute_element", "attribute_name", "attribute_value", "body_element", "body_req_element", "body_input_message", "body_topup_req_body_type", "body_topup_req_body_amount", "body_topup_req_body_msisdn", "od_header_element", "od_topup_resp_input_message", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21, $22, $23) RETURNING "id"

  def destroy
    @topup_recarga.destroy
---
DELETE FROM "topup_recargas" WHERE "topup_recargas"."id" = $1  [["id", 980190962]]

    def set_topup_recarga
      @topup_recarga = TopupRecarga.find(params[:id])
---
SELECT  "topup_recargas".* FROM "topup_recargas" WHERE "topup_recargas"."id" = $1 LIMIT $2  [["id", 980190962], ["LIMIT", 1]]