app/controllers/topup_validations_controller.rb

SELECT "topup_validations".* FROM "topup_validations"
---
  def index
    @topup_validations = TopupValidation.all

INSERT INTO "topup_validations" ("spree_order_id", "spree_products_id", "header_element", "validate_topup_req_header_element", "request_id", "header_timestamp", "header_source_system", "credentials_element", "credentials_user", "credentials_password", "attributes_list", "attributes_element", "attribute_name", "attribute_value", "body_element", "validation_topup_req", "validate_topup_input_message", "validate_topup_req_body_type", "validate_topup_req_body_amount", "validate_topup_req_body_msisdn", "op_header", "op_validate_topup_input_message", "op_request_id", "op_return_code", "op_return_message", "op_timestamp", "op_body_element", "op_body_validate_topup_resp", "op_body_validate_topup_output_message", "qtde_retry", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21, $22, $23, $24, $25, $26, $27, $28, $29, $30, $31, $32) RETURNING "id"
---
  def create
    @topup_validation = TopupValidation.new(topup_validation_params)

    respond_to do |format|
      if @topup_validation.save

DELETE FROM "topup_validations" WHERE "topup_validations"."id" = $1  [["id", 980190962]]
---
  def destroy
    @topup_validation.destroy

SELECT  "topup_validations".* FROM "topup_validations" WHERE "topup_validations"."id" = $1 LIMIT $2  [["id", 980190962], ["LIMIT", 1]]
---
    def set_topup_validation
      @topup_validation = TopupValidation.find(params[:id])